mbarbeau0545/Stm32PrjTpl/src/1_FMK/FMK_HAL/FKM_IO/Src/FMK_IO.c
/*********************************************************************
 * @file        FMKIO.c
 * @brief       Template_BriefDescription.
 * @details     TemplateDetailsDescription.\n
 *
 * @author      xxxxxx
 * @date        jj/mm/yyyy
 * @version     1.0
 */






// ********************************************************************
// *                      Includes
// ********************************************************************

#include "stm32f0xx_hal.h"
#include "./FMK_IO.h"
#include "FMK_CFG/FMKCFG_ConfigFiles/FMKIO_ConfigPrivate.h"
#include "FMK_HAL/FMK_CDA/Src/FMK_CDA.h"

// ********************************************************************
// *                      Defines
// ********************************************************************
#define FMKIO_AF_UNUSED ((t_uint8)0xFF)
// ********************************************************************
// *                      Types
// ********************************************************************
//-----------------------------ENUM TYPES-----------------------------//
/* CAUTION : Automatic generated code section for Enum: Start */

/* CAUTION : Automatic generated code section for Enum: End */

//-----------------------------TYPEDEF TYPES---------------------------//
//-----------------------------STRUCT TYPES---------------------------//
/* CAUTION : Automatic generated code section for Structure: Start */

/* CAUTION : Automatic generated code section for Structure: End */
typedef struct
{
    t_eFMKIO_PullMode       pull_e;
    t_eFMKIO_SpdMode        spd_e;
    t_eFMKIO_AlternateFunc  altFunc_e;
    t_bool                  IsSigConfigured_b;
    t_bool                  IsInterruptEnable_b;
    t_cbFMKIO_EventFunc *   EvntFunc_cb;
    
} t_sFMKIO_SigInfo;
// ********************************************************************
// *                      Prototypes
// ********************************************************************
	
// ********************************************************************
// *                      Variables
// ********************************************************************
t_sFMKIO_SigInfo g_InFreqSigInfo_as[FMKIO_INPUT_SIGFREQ_NB];
t_sFMKIO_SigInfo g_InAnaSigInfo_as[FMKIO_INPUT_SIGANA_NB];
t_sFMKIO_SigInfo g_InDigSigInfo_as[FMKIO_INPUT_SIGDIG_NB];
t_sFMKIO_SigInfo g_InEvntSigInfo_as[FMKIO_INPUT_SIGEVNT_NB];
t_sFMKIO_SigInfo g_OutPwmSigInfo_as[FMKIO_OUTPUT_SIGPWM_NB];
t_sFMKIO_SigInfo g_OutDigSigInfo_as[FMKIO_OUTPUT_SIGDIG_NB];

t_eFMKCPU_ClockPortOpe g_IsGpioClockEnable_ae[FMKIO_GPIO_PORT_NB] = {
    FMKCPU_CLOCKPORT_OPE_DISABLE, // FMKIO_GPIO_PORT_A
    FMKCPU_CLOCKPORT_OPE_DISABLE, // FMKIO_GPIO_PORT_B
    FMKCPU_CLOCKPORT_OPE_DISABLE, // FMKIO_GPIO_PORT_C
    FMKCPU_CLOCKPORT_OPE_DISABLE, // FMKIO_GPIO_PORT_D
    FMKCPU_CLOCKPORT_OPE_DISABLE, // FMKIO_GPIO_PORT_F
};

t_uint32 g_InFreqSigRawValue_ua32[FMKIO_INPUT_SIGFREQ_NB];

//********************************************************************************
//                      Local functions - Prototypes
//********************************************************************************
/*****************************************************************************
*
*	@brief
*	@details
*
*
*	@param[in] 
*	@param[out]
*	 
*
*
*/
static t_eReturnState s_FMKIO_Get_BspPullMode(t_eFMKIO_PullMode f_pull_e, t_uint32 *f_bspPull_pu32);
/*****************************************************************************
*
*	@brief
*	@details
*
*
*	@param[in] 
*	@param[out]
*	 
*
*
*/
static t_eReturnState s_FMKIO_Get_BspSpdMode(t_eFMKIO_SpdMode f_spd_e, t_uint32 *f_bspSpd_pu32);
/*****************************************************************************
*
*	@brief
*	@details
*
*
*	@param[in] 
*	@param[out]
*	 
*
*
*/
static t_eReturnState s_FMKIO_Get_BspGpioPort(t_eFMKIO_GpioPort f_GpioPort_e, GPIO_TypeDef ** f_BspGpio_ps);
/*****************************************************************************
*
*	@brief
*	@details
*
*
*	@param[in] 
*	@param[out]
*	 
*
*
*/
static t_eReturnState s_FMKIO_Get_BspTriggerMode(t_eFMKIO_SigTrigCptr f_trigger_e, t_uint32 * f_bspTrigger_pu32);
/*****************************************************************************
*
*	@brief
*	@details
*
*
*	@param[in] 
*	@param[out]
*	 
*
*
*/
static t_eReturnState s_FMKIO_Set_BspSigCfg(t_eFMKIO_GpioPort   f_gpioPort_e,
                                            t_eFMKIO_BspGpioPin f_pin_e,
                                            t_uint32            f_mode_u32,
                                            t_eFMKIO_PullMode   f_pull_e,
                                            t_eFMKIO_SpdMode    f_spd_e,
                                            t_uint8             f_AltFunc_u8);
/*****************************************************************************
*
*	@brief
*	@details
*
*
*	@param[in] 
*	@param[out]
*	 
*
*
*/
static t_eReturnState s_FMKIO_MngSigFrequency(t_eFMKCPU_Timer f_timer_e, t_eFMKCPU_InterruptChnl f_channel_e);
/**************************************************************************************
*
*	@brief
*	@details
*
*
*	@param[in] 
*	@param[out]
*	 
*
*
*/
static t_eReturnState s_FMKIO_Set_GpioClkState(t_eFMKIO_GpioPort f_gpioPort_e, t_eFMKCPU_ClockPortOpe f_ope_e);
//****************************************************************************
//                      Public functions - Implementation
//********************************************************************************
/*********************************
* s_FMKIO_Get_BspPullMode
*********************************/
t_eReturnState FMKIO_Set_InDigSigCfg(t_eFMKIO_InDigSig f_signal_e, t_eFMKIO_PullMode f_pull_e)
{
    t_eReturnState Ret_e = RC_OK;
    t_eFMKIO_GpioPort gpioPort_e;
    if(f_signal_e > FMKIO_INPUT_SIGDIG_NB
    || f_pull_e   > FMKIO_PULL_MODE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(Ret_e == RC_OK)
    {
        gpioPort_e = c_InDigSigBspMap_as[f_signal_e].HwGpio_e;
        Ret_e = s_FMKIO_Set_BspSigCfg(gpioPort_e,
                                     c_InDigSigBspMap_as[f_signal_e].HwPin_e,
                                     (t_uint32)MODE_INPUT,
                                     f_pull_e,
                                     FMKIO_SPD_MODE_LOW, // irrevelent for a input sig dig
                                     FMKIO_AF_UNUSED);
        if(Ret_e == RC_OK)
        {
            g_InDigSigInfo_as[f_signal_e].IsSigConfigured_b = (t_bool)True;
            g_InDigSigInfo_as[f_signal_e].pull_e = f_pull_e;
            g_InDigSigInfo_as[f_signal_e].spd_e  = FMKIO_SPD_MODE_LOW;
        }
    }
    return Ret_e;
}

