mbarbeau0545/Stm32PrjTpl/src/1_FMK/FMK_HAL/FKM_IO/Src/FMK_IO.c
/*********************************
* FMKIO_Set_InAnaSigCfg
*********************************/
t_eReturnState FMKIO_Set_InAnaSigCfg(t_eFMKIO_InAnaSig f_signal_e, t_eFMKIO_PullMode f_pull_e)
{
    t_eReturnState Ret_e = RC_OK;
    t_eFMKIO_GpioPort gpioPort_e;
    if(f_signal_e > FMKIO_INPUT_SIGANA_NB
    || f_pull_e   > FMKIO_PULL_MODE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(Ret_e == RC_OK)
    {
        gpioPort_e = c_InAnaSigBspMap_as[f_signal_e].HwGpio_e;
        Ret_e = s_FMKIO_Set_BspSigCfg(gpioPort_e,
                                     c_InAnaSigBspMap_as[f_signal_e].HwPin_e,
                                     (t_uint32)MODE_ANALOG,
                                     f_pull_e,
                                     FMKIO_SPD_MODE_LOW, // irrevelent for a input sig dig
                                     FMKIO_AF_UNUSED);
        if(Ret_e == RC_OK)
        {// configure the adc 
            Ret_e = FMKCDA_AddAdcChannelCfg(c_InAnaSigAdcCfg_ae[f_signal_e].adc_e, 
                                    c_InAnaSigAdcCfg_ae[f_signal_e].adcChannel_e,
                                    FMKCDA_ADC_CFG_SCAN_DMA);
            
            if(Ret_e == RC_OK)
            {// update info
                g_InAnaSigInfo_as[f_signal_e].IsSigConfigured_b = (t_bool)True;
                g_InAnaSigInfo_as[f_signal_e].pull_e = f_pull_e;
                g_InAnaSigInfo_as[f_signal_e].spd_e  = FMKIO_SPD_MODE_LOW;
            }
        }
    }
    return Ret_e;
}

/*********************************
* FMKIO_Set_InFreqSigCfg
*********************************/
t_eReturnState FMKIO_Set_InFreqSigCfg(t_eFMKIO_InFreqSig f_signal_e)
{
    t_eReturnState Ret_e = RC_OK;
    t_eFMKIO_GpioPort gpioPort_e;
    t_sFMKCPU_BspTimerCfg timerCfg_s;

    if(f_signal_e  > FMKIO_INPUT_SIGFREQ_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(Ret_e == RC_OK)
    {
        gpioPort_e = c_InFreqSigBspMap_as[f_signal_e].BasicCfg.HwGpio_e;
        Ret_e = s_FMKIO_Set_BspSigCfg(gpioPort_e,
                                    c_InFreqSigBspMap_as[f_signal_e].BasicCfg.HwPin_e,
                                    (t_uint32)GPIO_MODE_AF_PP,
                                    FMKIO_PULL_MODE_UNABLE,
                                    FMKIO_SPD_MODE_HIGH, // irrevelent for a input sig dig
                                    c_InFreqSigBspMap_as[f_signal_e].BspAlternateFunc_u8);
        if(Ret_e == RC_OK)
        {
            timerCfg_s.timer_e         = c_InFreqSigBspMap_as[f_signal_e].timer_e;
            timerCfg_s.channel_e       = c_InFreqSigBspMap_as[f_signal_e].channel_e;
            timerCfg_s.timerFreq_u32   = 0; // prescaler set to 0 in this cfg anyway
            timerCfg_s.timerPeriod_u32 = 0xFFFF;
            Ret_e = FMKCPU_Set_ICChannelCfg(timerCfg_s, FMKCPU_CHNL_MEAS_RISING_EDGE);
            if(Ret_e == RC_OK)
            {
                Ret_e = FMKCPU_AddTimerChnlCallback(timerCfg_s.timer_e,
                                                    timerCfg_s.channel_e,
                                                    (t_cbFMKCPU_InterruptChnl *)&s_FMKIO_MngSigFrequency);
            }
            if(Ret_e == RC_OK)
            {// update info
                g_InFreqSigInfo_as[f_signal_e].IsSigConfigured_b = (t_bool)True;
                g_InFreqSigInfo_as[f_signal_e].pull_e = FMKIO_PULL_MODE_UNABLE;
                g_InFreqSigInfo_as[f_signal_e].spd_e  = FMKIO_SPD_MODE_HIGH;
            }            
        }               
    }
    return Ret_e;
}
/*********************************
* FMKIO_Set_InEvntSigCfg
*********************************/
t_eReturnState FMKIO_Set_InEvntSigCfg(t_eFMKIO_InEvntSig f_signal_e, 
                                          t_eFMKIO_PullMode f_pull_e,
                                          t_eFMKIO_SigTrigCptr f_trigger_e,
                                          t_cbFMKIO_EventFunc * f_Evnt_cb)
{
    t_eReturnState Ret_e = RC_OK;
    t_eFMKIO_GpioPort gpioPort_e;
    t_uint32 bspTrigger_u32;

    if(f_signal_e  > FMKIO_INPUT_SIGEVNT_NB
    || f_pull_e    > FMKIO_PULL_MODE_NB
    || f_trigger_e > FMKIO_STC_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(f_Evnt_cb == (t_cbFMKIO_EventFunc *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        gpioPort_e = c_InEvntSigBspMap_as[f_signal_e].BasicCfg.HwGpio_e;
        Ret_e = s_FMKIO_Get_BspTriggerMode(f_trigger_e, &bspTrigger_u32);
        if(Ret_e == RC_OK)
        {
            Ret_e = s_FMKIO_Set_BspSigCfg(gpioPort_e,
                                        c_InEvntSigBspMap_as[f_signal_e].BasicCfg.HwPin_e,
                                        (t_uint32)bspTrigger_u32,
                                        FMKIO_PULL_MODE_UNABLE,
                                        FMKIO_SPD_MODE_LOW, // irrevelent for a input sig dig
                                        c_InFreqSigBspMap_as[f_signal_e].BspAlternateFunc_u8);
            if(Ret_e == RC_OK)
            {
                
                Ret_e = FMKCPU_Set_NVICState(c_InEvntSigBspMap_as[f_signal_e].ExtiIRQN_e,
                                             FMKCPU_NVIC_PRIORITY_MEDIUM,
                                             FMKCPU_NVIC_OPE_ENABLE);
                if(Ret_e == RC_OK)
                {// update info
                    g_InEvntSigInfo_as[f_signal_e].IsSigConfigured_b = (t_bool)True;
                    g_InEvntSigInfo_as[f_signal_e].pull_e = FMKIO_PULL_MODE_UNABLE;
                    g_InEvntSigInfo_as[f_signal_e].spd_e  = FMKIO_SPD_MODE_LOW;
                    g_InEvntSigInfo_as[f_signal_e].EvntFunc_cb = f_Evnt_cb;
                }
            }            
        }        
    }
    return Ret_e;
}
/*********************************
* FMKIO_Set_OutPwmSigCfg
*********************************/
t_eReturnState FMKIO_Set_OutPwmSigCfg(t_eFMKIO_OutPwmSig f_signal_e, 
                                      t_eFMKIO_PullMode  f_pull_e,
                                      t_uint32           f_frequency_u32,
                                      t_uint16           f_dutyCycle_u16,
                                      t_bool             f_startNow_b)
{
    t_eReturnState Ret_e = RC_OK;
    t_eFMKIO_GpioPort gpioPort_e;
    t_sFMKCPU_BspTimerCfg timerCfg_s;

    if(f_signal_e > FMKIO_OUTPUT_SIGPWM_NB
    || f_pull_e   > FMKIO_PULL_MODE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(Ret_e == RC_OK)
    {
        gpioPort_e = c_OutPwmSigBspMap_as[f_signal_e].BasicCfg.HwGpio_e;
        Ret_e = s_FMKIO_Set_BspSigCfg(gpioPort_e,
                                     c_OutPwmSigBspMap_as[f_signal_e].BasicCfg.HwPin_e,
                                     (t_uint32)GPIO_MODE_AF_PP,
                                     f_pull_e,
                                     FMKIO_SPD_MODE_LOW, // irrevelent for a input sig dig
                                     c_OutPwmSigBspMap_as[f_signal_e].BspAlternateFunc_u8);
        if(Ret_e == RC_OK)
        {
            timerCfg_s.timer_e         = c_OutPwmSigBspMap_as[f_signal_e].timer_e;
            timerCfg_s.channel_e       = c_OutPwmSigBspMap_as[f_signal_e].channel_e;
            timerCfg_s.timerFreq_u32   = f_frequency_u32;
            timerCfg_s.timerPeriod_u32 = (t_uint32)(1000-1); // 1ms
            Ret_e = FMKCPU_Set_PWMChannelCfg(timerCfg_s);
        
            if(Ret_e == RC_OK && f_startNow_b == (t_bool)True)
            {
                Ret_e = FMKCPU_Set_PWMChannelDuty(timerCfg_s.timer_e, 
                                                timerCfg_s.channel_e,
                                                f_dutyCycle_u16);
            }
            if(Ret_e == RC_OK)
            {// update info
                g_OutPwmSigInfo_as[f_signal_e].IsSigConfigured_b = (t_bool)True;
                g_OutPwmSigInfo_as[f_signal_e].pull_e = f_pull_e;
                g_OutPwmSigInfo_as[f_signal_e].spd_e  = FMKIO_SPD_MODE_LOW;
            }            
        }
    }
    #warning "f_dutyCycle not set on a channel"
    return Ret_e;
}

