mbarbeau0545/Stm32PrjTpl/src/1_FMK/FMK_HAL/FKM_IO/Src/FMK_IO.c
/*********************************
* s_FMKIO_Get_BspPullMode
*********************************/
t_eReturnState FMKIO_Set_OutDigSigCfg(t_eFMKIO_OutDigSig f_signal_e, 
                                          t_eFMKIO_PullMode  f_pull_e,
                                          t_eFMKIO_SpdMode   f_spd_e)
{
    t_eReturnState Ret_e = RC_OK;
    t_eFMKIO_GpioPort gpioPort_e;

    if(f_signal_e > FMKIO_OUTPUT_SIGDIG_NB
    || f_pull_e   > FMKIO_PULL_MODE_NB
    || f_spd_e    > FMKIO_SPD_MODE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(Ret_e == RC_OK)
    {
        gpioPort_e = c_OutDigSigBspMap_as[f_signal_e].HwGpio_e;
    
        Ret_e = s_FMKIO_Set_BspSigCfg(gpioPort_e,
                                     c_OutDigSigBspMap_as[f_signal_e].HwPin_e,
                                     (t_uint32)GPIO_MODE_OUTPUT_PP,
                                     f_pull_e,
                                     f_spd_e,
                                     FMKIO_AF_UNUSED);
        if(Ret_e == RC_OK)
        {
            g_OutDigSigInfo_as[f_signal_e].IsSigConfigured_b = (t_bool)True;
            g_OutDigSigInfo_as[f_signal_e].pull_e = f_pull_e;
            g_OutDigSigInfo_as[f_signal_e].spd_e  = f_spd_e;
        }
    }
    return Ret_e;
}

t_eReturnState FMKIO_Set_OutDigSigValue(t_eFMKIO_OutDigSig f_signal_e, t_eFMKIO_DigValue f_value_e)
{
    t_eReturnState Ret_e = RC_OK;
    GPIO_TypeDef *bspGpio_ps = (GPIO_TypeDef *)NULL;
    GPIO_PinState bspSigValue_e;

    if(f_signal_e > FMKIO_OUTPUT_SIGDIG_NB
    || f_value_e  > FMKIO_DIG_VALUE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(Ret_e == RC_OK)
    {
        Ret_e = s_FMKIO_Get_BspGpioPort(c_OutDigSigBspMap_as[f_signal_e].HwGpio_e, &bspGpio_ps);
        if(Ret_e == RC_OK)
        {
            switch (f_value_e)
            {
                case FMKIO_DIG_VALUE_LOW:
                    bspSigValue_e = GPIO_PIN_RESET;
                    break;
                case FMKIO_DIG_VALUE_HIGH:
                    bspSigValue_e = GPIO_PIN_SET;
                    break;
                case FMKIO_DIG_VALUE_NB:
                default:
                   Ret_e = RC_WARNING_WRONG_RESULT;
                   break;
            }
            if(Ret_e == RC_OK)
            {
                HAL_GPIO_WritePin(bspGpio_ps, 
                                  c_BspPinMapping_ua32[c_OutDigSigBspMap_as[f_signal_e].HwPin_e],
                                  bspSigValue_e);
            }
        }
    }
    return Ret_e;
}
/*********************************
* FMKIO_Set_OutPwmSigValue
*********************************/
t_eReturnState FMKIO_Set_OutPwmSigValue(t_eFMKIO_OutPwmSig f_signal_e, t_uint16 f_dutyCycle_u16)
{
    t_eReturnState Ret_e = RC_OK;

    if(f_signal_e > FMKIO_OUTPUT_SIGPWM_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(Ret_e == RC_OK)
    {
        Ret_e = FMKCPU_Set_PWMChannelDuty(c_OutPwmSigBspMap_as[f_signal_e].timer_e,
                                          c_OutPwmSigBspMap_as[f_signal_e].channel_e,
                                          f_dutyCycle_u16);
    }
    return Ret_e;
}

/*********************************
* FMKIO_Set_OutPwmSigValue
*********************************/
t_eReturnState FMKIO_Get_InDigSigValue(t_eFMKIO_InDigSig f_signal_e, t_eFMKIO_DigValue *f_value_pe)
{
    t_eReturnState Ret_e = RC_OK;
    GPIO_TypeDef *bspGpio_ps = (GPIO_TypeDef *)NULL;
    GPIO_PinState bspSigValue_e;

    if(f_signal_e > FMKIO_INPUT_SIGDIG_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(f_value_pe == (t_eFMKIO_DigValue *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        Ret_e = s_FMKIO_Get_BspGpioPort(c_InDigSigBspMap_as[f_signal_e].HwGpio_e, &bspGpio_ps);
        if(Ret_e == RC_OK)
        {
            bspSigValue_e = HAL_GPIO_ReadPin(bspGpio_ps, c_BspPinMapping_ua32[c_InDigSigBspMap_as[f_signal_e].HwPin_e]);
            switch (bspSigValue_e)
            {
                case GPIO_PIN_RESET:
                    *f_value_pe = FMKIO_DIG_VALUE_LOW;
                    break;
                case GPIO_PIN_SET:
                    *f_value_pe = FMKIO_DIG_VALUE_HIGH;
                    break;
                default:
                   *f_value_pe = FMKIO_DIG_VALUE_LOW;
                   Ret_e = RC_WARNING_WRONG_RESULT;
                   break;
            }
        }
    }
    return Ret_e;
}

/*********************************
* s_FMKIO_Get_BspPullMode
*********************************/
t_eReturnState FMKIO_Get_InAnaSigValue(t_eFMKIO_InAnaSig f_signal_e, t_uint16 *f_value_pu16)
{
    t_eReturnState Ret_e = RC_OK;
    if(f_signal_e > FMKIO_INPUT_SIGANA_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(f_value_pu16 == (t_uint16 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        Ret_e = FMKCDA_Get_AnaChannelMeasure(c_InAnaSigAdcCfg_ae[f_signal_e].adc_e,
                                             c_InAnaSigAdcCfg_ae[f_signal_e].adcChannel_e,
                                             f_value_pu16);
    }
    return Ret_e;

}

/*********************************
* FMKIO_Get_InFreqSigValue
*********************************/
t_eReturnState FMKIO_Get_InFreqSigValue(t_eFMKIO_InFreqSig f_signal_e, t_uint32 *f_value_pu32)
{
     t_eReturnState Ret_e = RC_OK;
    if(f_signal_e > FMKIO_INPUT_SIGFREQ_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(f_value_pu32 == (t_uint32 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        *f_value_pu32 = g_InFreqSigRawValue_ua32[f_signal_e];
    }
    return Ret_e;
}

/*********************************
* FMKIO_Get_OutPwmSigValue
*********************************/
t_eReturnState FMKIO_Get_OutPwmSigValue(t_eFMKIO_OutPwmSig f_signal_e, t_uint16 *f_value_pu16)
{
    t_eReturnState Ret_e = RC_OK;

    if(f_signal_e > FMKIO_OUTPUT_SIGPWM_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(f_value_pu16 == (t_uint16 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if(Ret_e == RC_OK)
    {
        Ret_e = FMKCPU_Get_PWMChannelDuty(c_OutPwmSigBspMap_as[f_signal_e].timer_e,
                                          c_OutPwmSigBspMap_as[f_signal_e].channel_e,
                                          f_value_pu16);
    }
    return Ret_e;
}

