mbarbeau0545/Stm32PrjTpl/src/1_FMK/FMK_HAL/FKM_IO/Src/FMK_IO.c
/*********************************
* s_FMKIO_Set_GpioClkState
*********************************/
static t_eReturnState s_FMKIO_Set_GpioClkState(t_eFMKIO_GpioPort f_gpioPort_e, t_eFMKCPU_ClockPortOpe f_ope_e)
{
    t_eReturnState Ret_e = RC_OK;
    t_eFMKCPU_ClockPort gpioClkPort_e ;

    if(f_gpioPort_e > FMKIO_GPIO_PORT_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if(Ret_e == RC_OK)
    {
        // get the GPIO CLOCK ENUM
        switch (f_gpioPort_e)
        {
            case FMKIO_GPIO_PORT_A:
                gpioClkPort_e = FMKCPU_RCC_CLK_GPIOA;
                break;
            case FMKIO_GPIO_PORT_B:
                gpioClkPort_e = FMKCPU_RCC_CLK_GPIOB;
                break;
            case FMKIO_GPIO_PORT_C:
                gpioClkPort_e = FMKCPU_RCC_CLK_GPIOC;
                break;
            case FMKIO_GPIO_PORT_F:
                gpioClkPort_e = FMKCPU_RCC_CLK_GPIOF;
                break;
            case FMKIO_GPIO_PORT_D:
            case FMKIO_GPIO_PORT_NB:
            default:
                Ret_e = RC_WARNING_NO_OPERATION;
                break;
        }
        if(Ret_e == RC_OK)
        {
            Ret_e = FMKCPU_Set_HwClock(gpioClkPort_e, f_ope_e);
        }
        if(Ret_e == RC_OK)
        {
            g_IsGpioClockEnable_ae[f_gpioPort_e] = f_ope_e;
        }
    }
    return Ret_e;
}
//************************************************************************************
// End of File
//************************************************************************************

/**
 *
 *	@brief
 *	@details
 *
 *
 *	@params[in] 
 *	@params[out]
 *	 
 *
 *
 */
